Revit 2027 API
ParameterTypeId.PathReinEndHookOrient2Wall Property
 "Alternating Bar - End Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookOrient2Wall { get; }
Public Shared ReadOnly Property PathReinEndHookOrient2Wall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookOrient2Wall {
	ForgeTypeId^ get ();
}
static member PathReinEndHookOrient2Wall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace